In [1]:
#!usr/bin/env python3
import os
import shutil
#import zipfile 
from zipfile import ZipFile 
import pandas as pd
import numpy as np
import dateutil #https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/
from datetime import datetime
import glob
import time
from io import StringIO

# Hide warning messages in notebook
import warnings
warnings.filterwarnings('ignore')

In [2]:
pd.set_option("max_rows", 100)

In [3]:
cur_dir = os.getcwd()
cur_dir

'/Users/Werd/boot_camp/gitlib/tableau-challenge'

In [4]:
cleansed_dir = os.path.join(cur_dir,'citibike_files','cleansed')
cleansed_dir

'/Users/Werd/boot_camp/gitlib/tableau-challenge/citibike_files/cleansed'

In [5]:
path = cleansed_dir

all_files = sorted(glob.glob(os.path.join(path, "*citibike*")))

all_df = []

#parse_dates=['starttime','stoptime'],

for f in all_files:
    try: 
        print('try:' + f)
        df = pd.read_csv(f, sep=',',header = 1,skiprows = 1)
        print(len(df.index))
    except:
         print('except:' + f)

try:/Users/Werd/boot_camp/gitlib/tableau-challenge/citibike_files/cleansed/citibike_bike_usage.csv
97093
try:/Users/Werd/boot_camp/gitlib/tableau-challenge/citibike_files/cleansed/citibike_customer.csv
3526
try:/Users/Werd/boot_camp/gitlib/tableau-challenge/citibike_files/cleansed/citibike_station.csv
5708
try:/Users/Werd/boot_camp/gitlib/tableau-challenge/citibike_files/cleansed/citibike_trips_daily.csv
2547
try:/Users/Werd/boot_camp/gitlib/tableau-challenge/citibike_files/cleansed/citibike_trips_hourly.csv
61115

In [6]:
# citibike_bike_date.csv
# citibike_bike_use.csv
# citibike_customer.csv
# citibike_station.csv
# citibike_trips_daily.csv
# citibike_trips_hourly.csv

In [7]:
cur_dir = os.getcwd()
cur_dir

'/Users/Werd/boot_camp/gitlib/tableau-challenge'

In [8]:
station_csv = os.path.join(cur_dir,'citibike_files','cleansed','citibike_station.csv')
station_csv

'/Users/Werd/boot_camp/gitlib/tableau-challenge/citibike_files/cleansed/citibike_station.csv'

In [9]:
station_transform_df = pd.read_csv(station_csv, low_memory=False)
station_transform_df

,start station id,start station latitude,start station longitude,start station name
0,406.0,40.695130,-73.995950,Hicks St & Montague St
1,475.0,40.735240,-73.987590,E 15 St & Irving Pl
2,2008.0,40.705692,-74.016780,Little West St & 1 Pl
3,485.0,40.750380,-73.983390,W 37 St & 5 Ave
4,285.0,40.734547,-73.990740,Broadway & E 14 St
...,...,...,...,...
5705,3958.0,40.812298,-73.920370,Willis Ave & E 143 St
5706,3955.0,40.808890,-73.910810,St Mary's St & Jackson Ave
5707,3956.0,40.811110,-73.914930,St. Ann's Ave & E 144 St
5708,3941.0,40.801660,-73.909515,Walnut Ave & E 136 St
5709,3957.0,40.811676,-73.917040,E 144 St & Brook Ave

In [10]:
station_transform_df.dtypes

start station id           float64
start station latitude     float64
start station longitude    float64
start station name          object
dtype: object

In [11]:
#soccer_2018_df.loc[soccer_2018_df["Preferred Position"] == "ST", :]
#station_transform_df.loc[station_transform_df["start station id"] == "start station id", :]

In [12]:
station_transform_df['start station id'].value_counts()

519.0     13
517.0     12
468.0     12
504.0     12
2022.0    11
          ..
3735.0     1
3937.0     1
4016.0     1
3994.0     1
3958.0     1
Name: start station id, Length: 1119, dtype: int64

In [13]:
station_transform_df['start station id'] = station_transform_df['start station id'].astype(str).astype(float).astype(int)
station_transform_df['start station latitude'] = station_transform_df['start station latitude'].astype(float)
station_transform_df['start station latitude'] = station_transform_df['start station latitude'].round(decimals=3)
station_transform_df['start station longitude'] = station_transform_df['start station longitude'].astype(float)
station_transform_df['start station longitude'] = station_transform_df['start station longitude'].round(decimals=3)

In [14]:
station_transform_df['start station latitude'] = station_transform_df['start station latitude'].astype(float)
station_transform_df['start station latitude'] = station_transform_df['start station latitude'].round(decimals=3)

In [15]:
station_transform_df['start station longitude'] = station_transform_df['start station longitude'].astype(float)
station_transform_df['start station longitude'] = station_transform_df['start station longitude'].round(decimals=3)

In [16]:
distinct_stations_df = station_transform_df.drop_duplicates(subset=['start station id'])

In [17]:
distinct_stations_df.set_index('start station id',inplace=True)

In [18]:
distinct_stations_df.sort_index(axis = 0)

,start station latitude,start station longitude,start station name
start station id,,,
72,40.767,-73.994,W 52 St & 11 Ave
79,40.719,-74.007,Franklin St & W Broadway
82,40.711,-74.000,St James Pl & Pearl St
83,40.684,-73.976,Atlantic Ave & Fort Greene Pl
116,40.742,-74.001,W 17 St & 8 Ave
...,...,...,...
3998,40.814,-73.939,W 135 St & Lenox Terrace Pl
4016,40.812,-73.946,Adam Clayton Powell Blvd & W 130 St
4017,40.814,-73.936,E 138 St & 5 Av
4019,40.803,-73.920,St. Ann's Av & Bruckner Blvd
4021,40.813,-73.931,E 138 St & Grand Concourse

## Bikes

In [19]:
bike_usage_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_bike_usage.csv'))
bike_usage_df

       bikeid         min         max  count      sum
0       14529  2013-06-05  2013-12-31    885   825072
1       14531  2013-06-01  2013-12-31   1125  1031192
2       14532  2013-06-02  2013-12-28   1224  1139052
3       14533  2013-06-06  2013-12-27   1035  1030752
4       14534  2013-06-01  2013-12-28   1052  1038703
...       ...         ...         ...    ...      ...
97090   44053  2020-05-31  2020-05-31     15    95802
97091   44054  2020-05-31  2020-05-31      3     3672
97092   44055  2020-05-31  2020-05-31      2     3730
97093   44056  2020-05-31  2020-05-31     10    13226
97094   44057  2020-05-31  2020-05-31     14    23665

[97095 rows x 5 columns]

In [20]:
customer_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_customer.csv'))
customer_df

      Unnamed: 0  yearmonth  gender  age bracket    usertype   count
0              0     201306       0      (-1, 1]    Customer  232801
1              1     201306       0      (-1, 1]  Subscriber       0
2              2     201306       0      (1, 18]    Customer       0
3              3     201306       0      (1, 18]  Subscriber       0
4              4     201306       0     (18, 25]    Customer       0
...          ...        ...     ...          ...         ...     ...
3523         205     202005       2     (45, 65]  Subscriber   76541
3524         206     202005       2    (65, 100]    Customer     355
3525         207     202005       2    (65, 100]  Subscriber    8091
3526         208     202005       2  (100, 1000]    Customer       3
3527         209     202005       2  (100, 1000]  Subscriber     184

[3528 rows x 6 columns]

In [21]:
station_df = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_station.csv'))
station_df

,start station id,start station latitude,start station longitude,start station name
0,406.0,40.695130,-73.995950,Hicks St & Montague St
1,475.0,40.735240,-73.987590,E 15 St & Irving Pl
2,2008.0,40.705692,-74.016780,Little West St & 1 Pl
3,485.0,40.750380,-73.983390,W 37 St & 5 Ave
4,285.0,40.734547,-73.990740,Broadway & E 14 St
...,...,...,...,...
5705,3958.0,40.812298,-73.920370,Willis Ave & E 143 St
5706,3955.0,40.808890,-73.910810,St Mary's St & Jackson Ave
5707,3956.0,40.811110,-73.914930,St. Ann's Ave & E 144 St
5708,3941.0,40.801660,-73.909515,Walnut Ave & E 136 St
5709,3957.0,40.811676,-73.917040,E 144 St & Brook Ave

In [22]:
trips_daily = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_trips_daily.csv'))
trips_daily

       startdate  count        sum
0     2013-06-01   8396   20949939
1     2013-06-02  15430   31983024
2     2013-06-03   7325   13696509
3     2013-06-04  15228   47275557
4     2013-06-05  15173   37382523
...          ...    ...        ...
2544  2020-05-27  55071   81965270
2545  2020-05-28  46091   64410757
2546  2020-05-29  53356   73176648
2547  2020-05-30  87081  151442490
2548  2020-05-31  80706  136775415

[2549 rows x 3 columns]

In [23]:
trips_hourly = pd.read_csv(os.path.join(cur_dir,'citibike_files','cleansed','citibike_trips_hourly.csv'))
trips_hourly

        startdate starthour  count      sum
0      2013-06-01        00    147   508309
1      2013-06-01        01    101   162181
2      2013-06-01        02     64   142713
3      2013-06-01        03     39   107823
4      2013-06-01        04     15    21727
...           ...       ...    ...      ...
61112  2020-05-31        19   5482  9761875
61113  2020-05-31        20   3812  5839526
61114  2020-05-31        21   2121  3701846
61115  2020-05-31        22   1573  3116295
61116  2020-05-31        23   1070  2290951

[61117 rows x 4 columns]